{
  "movies": [
    {
      "title": "Batman vs Superman Origem da Justiça",
      "wallpaper": "https://wallpapercave.com/wp/wp2575288.jpg",
      "trailer": "https://www.youtube.com/embed/IHDgrNxO-5I?si=ag35nsvCOF2bhGII",
      "synopsis": "Em Batman Vs Superman - A Origem Da Justiça, o confronto entre Superman (Henry Cavill) e Zod (Michael Shannon) em Metrópolis fez com que a população mundial se dividisse acerca da existência de extra-terrestres na Terra. Enquanto muitos consideram o Superman como um novo deus, há aqueles que consideram extremamente perigoso que haja um ser tão poderoso sem qualquer tipo de controle. Bruce Wayne (Ben Affleck) é um dos que acreditam nesta segunda hipótese. Sob o manto de um Batman violento e obcecado, ele investiga o laboratório de Lex Luthor (Jesse Eisenberg), que descobriu uma pedra verde que consegue eliminar e enfraquecer os filhos de Krypton.",
      "publishingCompany": "DC Comics",
      "id": 1
    },
    {
      "title": "Liga da Justiça Snyder Cut",
      "wallpaper": "https://images4.alphacoders.com/113/1137701.jpg",
      "trailer": "https://www.youtube.com/embed/BifA90UAQtg?si=5oOFuvxbyL60wxvZ",
      "synopsis": "Depois de restaurar sua fé na humanidade e inspirado pelo ato altruísta do Superman, Bruce Wayne convoca Diana Prince para combater um inimigo ainda maior, recém-despertado. Juntos, Batman e Mulher-Maravilha buscam e recrutam um time de meta-humanos, mas mesmo com a formação da liga de heróis sem precedentes -- Batman, Mulher-Maravilha, Aquaman, Ciborgue, e Flash -- poderá ser tarde demais para salvar o planeta de um catastrófico ataque.",
      "publishingCompany": "DC Comics",
      "id": 3
    },
    {
      "title": "Aquaman",
      "wallpaper": "https://images7.alphacoders.com/968/968870.jpg",
      "trailer": "https://www.youtube.com/embed/llJsEaqhNRk?si=hanhhciaf10iqMvn",
      "synopsis": "Em Aquaman, filho do humano Tom Curry (Temuera Morrison) com a atlante Atlanna (Nicole Kidman), Arthur Curry (Jason Momoa) cresce com a vivência de um humano e as capacidades metahumanas de um atlante. Quando seu irmão Orm (Patrick Wilson) deseja se tornar o Mestre dos Oceanos, subjugando os demais reinos aquáticos para que possa atacar a superfície, cabe a Arthur a tarefa de impedir a guerra iminente. Para tanto, ele recebe a ajuda de Mera (Amber Heard), princesa de um dos reinos, e o apoio de Vulko (Willem Dafoe), que o treinou secretamente desde a adolescência.",
      "publishingCompany": "DC Comics",
      "id": 4
    },
    {
      "title": "Mulher Maravilha",
      "wallpaper": "https://images7.alphacoders.com/760/760447.jpg",
      "trailer": "https://www.youtube.com/embed/I6Gj8Fvukk4?si=_rQkeavq4Xnm_c-z",
      "synopsis": "Em Mulher-Maravilha, treinada desde cedo para ser uma guerreira imbatível, Diana Prince (Gal Gadot) nunca saiu da paradisíaca ilha em que é reconhecida como princesa das Amazonas. Quando o piloto Steve Trevor (Chris Pine) se acidenta e cai numa praia do local, ela descobre que uma guerra sem precedentes está se espalhando pelo mundo e decide deixar seu lar certa de que pode parar o conflito. Lutando para acabar com todas as lutas, Diana percebe o alcance de seus poderes e sua verdadeira missão na Terra.",
      "publishingCompany": "DC Comics",
      "id": 5
    },
    {
      "title": "Adão Negro",
      "wallpaper": "https://images6.alphacoders.com/127/1277700.jpg",
      "trailer": "https://www.youtube.com/embed/I3CpaqCK9B0?si=nOuwpCnl7D5eAp1e",
      "synopsis": "Adão Negro é o filme solo do anti-herói, baseado no personagem em quadrinhos Black Adam (Dwayne Johnson) da DC Comics, grande antagonista de Shazam!, tendo no longa, sua história de origem explorada, e revelando seu passado de escravo no país Kahndaq. Nascido no Egito Antigo, o anti-herói tem super força, velocidade, resistência, capacidade de voar e de disparar raios. Alter ego de Teth-Adam e filho do faraó Ramsés II, Adão Negro foi consumido por poderes mágicos e transformado em um feiticeiro. Grande inimigo de Shazam! nas HQs, apesar dele acreditar em seu pontecial e, inclusive, oferecê-lo como um guerreiro do bem, Adão Negro acaba usando suas habilidades especiais para o mal. O anti-herói em busca de redenção ou um herói que se tornou vilão, pode ser capaz de destruir tudo o que estiver pela frente - ou de encontrar seu caminho.",
      "publishingCompany": "DC Comics",
      "id": 6
    },
    {
      "title": "The Batman",
      "wallpaper": "https://images3.alphacoders.com/118/1185634.jpg",
      "trailer": "https://www.youtube.com/embed/XmazCGOqO2g?si=p-gFXPum71fyw_XM",
      "synopsis": "Batman (The Batman, no original) segue o segundo ano de Bruce Wayne (Robert Pattinson) como o herói de Gotham, causando medo nos corações dos criminosos da sombria cidade. Com apenas alguns aliados de confiança - Alfred Pennyworth (Andy Serkis) e o tenente James Gordon (Jeffrey Wright) - entre a rede corrupta de funcionários e figuras importantes do distrito, o vigilante solitário se estabeleceu como a única personificação da vingança entre seus concidadãos. Durante uma de suas investigações, Bruce acaba envolvendo a si mesmo e Gordon em um jogo de gato e rato, ao investigar uma série de maquinações sádicas em uma trilha de pistas enigmáticas estabelecida pelo vilão Charada. Quando o trabalho acaba o levando a descobrir uma onda de corrupção que envolve o nome de sua família, pondo em risco a própria integridade e as memórias que tinha sobre seu pai, Thomas Wayne, as evidências começam a chegar mais perto de casa, precisando, Batman, forjar novos relacionamentos, para assim desmascarar o culpado e fazer justiça ao abuso de poder e à corrupção que há muito tempo assola Gotham City.",
      "publishingCompany": "DC Comics",
      "id": 7
    },
    {
      "title": "O Esquadrão Suicida",
      "wallpaper": "https://images4.alphacoders.com/115/1156313.jpg",
      "trailer": "https://www.youtube.com/embed/77fe8sHFG6M?si=gZKY7lTgvmB0sb0E",
      "synopsis": "Liderados por Sanguinário (Idris Elba), Pacificador (John Cena), Coronel Rick Flag (Joel Kinnaman), e pela psicopata favorita de todos, Arlequina (Margot Robbie), o Esquadrão Suicida está disposto a fazer qualquer coisa para escapar da prisão. Armados até os dentes e rastreados pela equipe de Amanda Waller (Viola Davis), eles são jogados (literalmente) na remota ilha Corto Maltese, repleta de militantes adversários e forças de guerrilha. O grupo de supervilões busca destruição, mas basta um movimento errado para que acabem mortos.",
      "publishingCompany": "DC Comics",
      "id": 8
    },
    {
      "title": "Batman O Cavaleiros da Trevas",
      "wallpaper": "https://images5.alphacoders.com/109/1092637.jpg",
      "trailer": "https://www.youtube.com/embed/zqfz04yCTnE?si=H8esDch8MzEwt9Hp",
      "synopsis": "Após dois anos desde o surgimento do Batman (Christian Bale), os criminosos de Gotham City têm muito o que temer. Com a ajuda do tenente James Gordon (Gary Oldman) e do promotor público Harvey Dent (Aaron Eckhart), Batman luta contra o crime organizado. Acuados com o combate, os chefes do crime aceitam a proposta feita pelo Coringa (Heath Ledger) e o contratam para combater o Homem-Morcego.",
      "publishingCompany": "DC Comics",
      "id": 9
    },
    {
      "title": "Coringa",
      "wallpaper": "https://images8.alphacoders.com/104/1045909.jpg",
      "trailer": "https://www.youtube.com/embed/-pVENaL5OSo?si=MwcPUOX_Zt60rbDT",
      "synopsis": "Em Coringa, Arthur Fleck (Joaquin Phoenix) trabalha como palhaço para uma agência de talentos e, toda semana, precisa comparecer a uma agente social, devido aos seus conhecidos problemas mentais. Após ser demitido, Fleck reage mal à gozação de três homens em pleno metrô e os mata. Os assassinatos iniciam um movimento popular contra a elite de Gotham City, da qual Thomas Wayne (Brett Cullen) é seu maior representante.",
      "publishingCompany": "DC Comics",
      "id": 10
    },
    {
      "title": "Vingadores Guerra Infinita",
      "wallpaper": "https://images4.alphacoders.com/909/thumb-1920-909185.jpg",
      "trailer": "https://www.youtube.com/embed/htQch8jDZ4s?si=Qw0xAjeY6788oe3u",
      "synopsis": "Em Vingadores: Guerra Infinita, Thanos (Josh Brolin) enfim chega à Terra, disposto a reunir as Joias do Infinito. Para enfrentá-lo, os Vingadores precisam unir forças com os Guardiões da Galáxia, ao mesmo tempo em que lidam com desavenças entre alguns de seus integrantes.",
      "publishingCompany": "Marvel",
      "id": 11
    }
  ],
  "colors": [
    {
      "publishingCompany": "DC Comics",
      "background": "#2A2AFFB3",
      "color": "#FFFFFF",
      "id": 1
    },
    {
      "publishingCompany": "Marvel",
      "background": "#FF0000",
      "color": "#FFFFFF",
      "id": 2
    }
  ]
}